app/controllers/events_controller.rb

INSERT INTO `events` (`created_at`, `event_date`, `event_details`, `event_name`, `event_time`, `event_venue`, `updated_at`) VALUES ('2013-04-25 05:46:33', NULL, NULL, NULL, NULL, NULL, '2013-04-25 05:46:33')
---
	def create
		@event = Event.create!(params[:event])