app/controllers/profiles_controller.rb

INSERT INTO `profiles` (`created_at`, `date_of_birth`, `first_name`, `last_name`, `place`, `updated_at`) VALUES ('2013-04-25 12:39:37', '2013-04-25', 'QLink', 'project', 'kakkanad', '2013-04-25 12:39:37')
---
	def create
		@profile= Profile.create(params[:profile])